RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_gpio.c
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPIO(HT_GPIOx));
  Assert_Param(IS_GPIO_PR(GPIO_PR_x));

  GPIO_CK_ON();
  temp_up = HT_GPIOx->PUR;
  temp_down = HT_GPIOx->PDR;

  #if (LIBCFG_GPIO_PR_STRONG_UP)
  temp_up   &= ~(GPIO_PIN_nBITMAP << 16);
  #endif
  temp_up   &= ~GPIO_PIN_nBITMAP;
  temp_down &= ~GPIO_PIN_nBITMAP;

  switch (GPIO_PR_x)
  {
    case GPIO_PR_UP:
      temp_up   |= GPIO_PIN_nBITMAP;
      break;
    case GPIO_PR_DOWN:
      temp_down |= GPIO_PIN_nBITMAP;
      break;
    case GPIO_PR_DISABLE:
      break;
    #if (LIBCFG_GPIO_PR_STRONG_UP)
    case GPIO_PR_STRONG_UP:
      temp_up   |= (GPIO_PIN_nBITMAP << 16);
      break;
    case GPIO_PR_STRONGEST_UP:
      temp_up   |= (GPIO_PIN_nBITMAP << 16);
      temp_up   |= GPIO_PIN_nBITMAP;
      break;
    #endif
    default:
      break;
  }

  HT_GPIOx->PUR = temp_up;
  HT_GPIOx->PDR = temp_down;

  GPIO_CK_OFF();
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the input control of specified GPIO pins.
 * @param HT_GPIOx: where HT_GPIOx is the selected GPIO from the GPIO peripherals.
 * @param GPIO_PIN_nBITMAP: The port pins.
 *   This parameter can be any combination of GPIO_PIN_x.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void GPIO_InputConfig(HT_GPIO_TypeDef* HT_GPIOx, u16 GPIO_PIN_nBITMAP, ControlStatus Cmd)
{
  GPIO_CK_ST;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPIO(HT_GPIOx));
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  GPIO_CK_ON();
  if (Cmd != DISABLE)
    HT_GPIOx->INER |= GPIO_PIN_nBITMAP;
  else
    HT_GPIOx->INER &= ~GPIO_PIN_nBITMAP;
  GPIO_CK_OFF();
}

/*********************************************************************************************************//**
 * @brief Select the driving current of specified GPIO pins.
 * @param HT_GPIOx: where HT_GPIOx is the selected GPIO from the GPIO peripherals.
 * @param GPIO_PIN_nBITMAP: The port pins.
 *   This parameter can be any combination of GPIO_PIN_x.
 * @param GPIO_DV_nMA:
 *   This parameter can be one of below:
 *     @arg GPIO_DV_4MA  : Select output driving current as  4 mA
 *     @arg GPIO_DV_8MA  : Select output driving current as  8 mA
 *     @arg GPIO_DV_12MA : Select output driving current as 12 mA
 *     @arg GPIO_DV_16MA : Select output driving current as 16 mA
 * @retval None
 ************************************************************************************************************/
void GPIO_DriveConfig(HT_GPIO_TypeDef* HT_GPIOx, u16 GPIO_PIN_nBITMAP, GPIO_DV_Enum GPIO_DV_nMA)
{
  u32 index, temp, CurrentMode = 0, PinPosition = 0;
  GPIO_CK_ST;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPIO(HT_GPIOx));
  Assert_Param(IS_GPIO_DV(GPIO_DV_nMA));

  for (index = 0; index < 16; index++)
  {
    if ((GPIO_PIN_nBITMAP & 0x0001) == 1)
    {
      temp = index << 1;
      CurrentMode |= ((u32) GPIO_DV_nMA << temp);
      PinPosition |= ((u32) 0x03  << temp);
    }
    GPIO_PIN_nBITMAP >>= 1;
  }

  GPIO_CK_ON();
  HT_GPIOx->DRVR &= ~PinPosition;
  HT_GPIOx->DRVR |= CurrentMode;
  GPIO_CK_OFF();
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the open drain function of specified GPIO pins.
 * @param HT_GPIOx: where HT_GPIOx is the selected GPIO from the GPIO peripherals.
 * @param GPIO_PIN_nBITMAP: The port pins.
 *   This parameter can be any combination of GPIO_PIN_x.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void GPIO_OpenDrainConfig(HT_GPIO_TypeDef* HT_GPIOx, u16 GPIO_PIN_nBITMAP, ControlStatus Cmd)
{
  GPIO_CK_ST;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPIO(HT_GPIOx));
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  GPIO_CK_ON();
  if (Cmd != DISABLE)
    HT_GPIOx->ODR |= GPIO_PIN_nBITMAP;
  else
    HT_GPIOx->ODR &= ~GPIO_PIN_nBITMAP;
  GPIO_CK_OFF();
}

#if (LIBCFG_GPIO_SINK_CURRENT_ENHANCED)
/*********************************************************************************************************//**
 * @brief Select the sink current of specified GPIO pins.
 * @param HT_GPIOx: where HT_GPIOx is the selected GPIO from the GPIO peripherals.
 * @param GPIO_PIN_n: The port pins.
 *   This parameter can be any combination of GPIO_PIN_x.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void GPIO_SinkConfig(HT_GPIO_TypeDef* HT_GPIOx, u16 GPIO_PIN_n, ControlStatus Cmd)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPIO(HT_GPIOx));
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  if (Cmd != DISABLE)
    HT_GPIOx->SCER |= GPIO_PIN_n;
  else
    HT_GPIOx->SCER &= ~GPIO_PIN_n;
}
#endif

/*********************************************************************************************************//**
 * @brief Get the input data of specified port pin.
 * @param HT_GPIOx: where HT_GPIOx is the selected GPIO from the GPIO peripherals.
 * @param GPIO_PIN_n: This parameter can be GPIO_PIN_x.
 * @retval SET or RESET
 ************************************************************************************************************/
FlagStatus GPIO_ReadInBit(HT_GPIO_TypeDef* HT_GPIOx, u16 GPIO_PIN_n)
{
  FlagStatus result;
  GPIO_CK_ST;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPIO(HT_GPIOx));

  GPIO_CK_ON();
  if ((HT_GPIOx->DINR & GPIO_PIN_n) != RESET)
    result = SET;
  else
    result = RESET;

  GPIO_CK_OFF();
  return result;
}

