RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_gpio.c
/*********************************************************************************************************//**
 * @brief Select the GPIO pin to be used as EXTI channel.
 * @param GPIO_PIN_NUM_n: Specify the GPIO pin number to be configured.
 * @param GPIO_Px: GPIO_PA ~ GPIO_PF.
 * @retval None
 ************************************************************************************************************/
void AFIO_EXTISourceConfig(u32 GPIO_PIN_NUM_n, u32 GPIO_Px)
{
  u8 index = 0;
  u32 tmp = 0;
  AFIO_CK_ST;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPIO_PORT(GPIO_Px));
  Assert_Param(IS_GPIO_PIN_NUM(GPIO_PIN_NUM_n));

  AFIO_CK_ON();

  if (GPIO_PIN_NUM_n > 7)
  {
    #if (LIBCFG_EXTI_8CH)
    GPIO_Px += 8;
    #else
    index = 1;
    #endif
    GPIO_PIN_NUM_n -= 8;
  }

  tmp = HT_AFIO->ESSR[index];
  tmp &= ~((u32)0x0F << (GPIO_PIN_NUM_n * 4));
  tmp |= (u32)GPIO_Px << (GPIO_PIN_NUM_n * 4);
  HT_AFIO->ESSR[index] = tmp;
  AFIO_CK_OFF();
}
/**
  * @}
  */

/* Private functions ---------------------------------------------------------------------------------------*/
/** @defgroup GPIO_Private_Functions GPIO private functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief Turn on/Turn off specify GPIO clock.
 * @param HT_GPIOx: where HT_GPIOx is the selected GPIO from the GPIO peripherals.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval TRUE or FALSE (TRUE: already turn on, FALSE, Turn on by this call)
 ***********************************************************************************************************/
u32 _GPIO_ClockControl(HT_GPIO_TypeDef* HT_GPIOx, ControlStatus Cmd)
{
  u32 PxENStatus;
  /*--------------------------------------------------------------------------------------------------------*/
  /* ((0x400Bx000 & 0x0000F000) >> 12 ) / 2 + 16 =                                                          */
  /*  (0x0 ~ 0x4) + 16 = 16 ~ 20 for AHBCCR PAEN ~ PEEN bit offset                                          */
  /*--------------------------------------------------------------------------------------------------------*/
  u32 offset = ((((u32)HT_GPIOx) & 0x0000F000) >> 12) / 2 + 16;

  PxENStatus = HT_CKCU->AHBCCR & (1 << offset);

  if (PxENStatus != 0)
  {
    if (Cmd == DISABLE)
    {
      HT_CKCU->AHBCCR &= (~(1 << offset));
    }
    return TRUE;
  }

  HT_CKCU->AHBCCR |= (1 << offset);
  return FALSE;
}

/*********************************************************************************************************//**
 * @brief Turn on/Turn off AFIO clock.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval TRUE or FALSE (TRUE: already turn on, FALSE, Turn on by this call)
 ***********************************************************************************************************/
u32 _AFIO_ClockControl(ControlStatus Cmd)
{
  u32 AFIOENStatus;

  AFIOENStatus = HT_CKCU->APBCCR0 & (1 << 14);

  if (AFIOENStatus != 0)
  {
    if (Cmd == DISABLE)
    {
      HT_CKCU->APBCCR0 &= (~(1 << 14));
    }
    return TRUE;
  }

  HT_CKCU->APBCCR0 |= (1 << 14);
  return FALSE;
}
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
